#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/lambda-authorizer/runs/run-4cC6bX1zpEwPAnWv

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
data.aws_apigatewayv2_vpc_link.vpc_link: Refreshing...
data.aws_iam_role.lab_role: Refreshing...
data.aws_lb.eks_nlb: Refreshing...
data.aws_apigatewayv2_api.api_gateway: Refreshing...
aws_apigatewayv2_route.docs_route: Refreshing state... [id=rclg5pa]
aws_apigatewayv2_route.favicon_route: Refreshing state... [id=3lpaohc]
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=cognito-authorizer]
data.aws_apigatewayv2_api.api_gateway: Refresh complete after 0s [id=yedv13j998]
data.aws_apigatewayv2_vpc_link.vpc_link: Refresh complete after 0s [id=ebxfqq]
data.aws_lb.eks_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:721525683170:loadbalancer/net/a7aa0b083ea014cdaa41f082c1423efa/18171ea8803ff1ef]
data.aws_lb_listener.eks_listener: Refreshing...
data.aws_lb_listener.eks_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:721525683170:listener/net/a7aa0b083ea014cdaa41f082c1423efa/18171ea8803ff1ef/9307cef60f9307e5]
aws_apigatewayv2_integration.eks_integration: Refreshing state... [id=tt1k2id]
aws_apigatewayv2_authorizer.lambda_authorizer: Refreshing state... [id=0gryey]
aws_apigatewayv2_route.docs_proxy_route: Refreshing state... [id=xij5zl3]
aws_apigatewayv2_route.eks_route_with_auth: Refreshing state... [id=p7jo6tm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_apigatewayv2_route.docs_proxy_route will be updated in-place
  ~ resource "aws_apigatewayv2_route" "docs_proxy_route" {
        id                                  = "xij5zl3"
      ~ route_key                           = "GET /docs/{proxy+}" -> "ANY /{proxy+}"
        # (10 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.docs_route will be destroyed
  - resource "aws_apigatewayv2_route" "docs_route" {
      - api_id                              = "yedv13j998" -> null
      - api_key_required                    = false -> null
      - authorization_scopes                = [] -> null
      - authorization_type                  = "NONE" -> null
      - id                                  = "rclg5pa" -> null
      - request_models                      = {} -> null
      - route_key                           = "GET /docs" -> null
      - target                              = "integrations/tt1k2id" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_apigatewayv2_route.favicon_route will be destroyed
  - resource "aws_apigatewayv2_route" "favicon_route" {
      - api_id                              = "yedv13j998" -> null
      - api_key_required                    = false -> null
      - authorization_scopes                = [] -> null
      - authorization_type                  = "NONE" -> null
      - id                                  = "3lpaohc" -> null
      - request_models                      = {} -> null
      - route_key                           = "GET /favicon.ico" -> null
      - target                              = "integrations/tt1k2id" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "cognito-authorizer"
      ~ last_modified                  = "2024-12-17T16:27:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:16/invocations" -> (known after apply)
      ~ source_code_hash               = "cdbFmgY2q3pnQMYaK0Fs6zDl80urKVfI/xKd/0HKt4E=" -> "8bCJcVsZnPhRqPuJOMVpaeiYj8itt5Tp7Kb/32FN1lk="
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*